---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.EndExportInternal(Autodesk.Revit.DB.IFC.ExporterIFC)
source: html/c80884d8-8670-33dd-fb29-0aff27e966de.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.EndExportInternal Method

Use the internal Revit implementation to relate elements at the end of export.

## Syntax (C#)
```csharp
public static void EndExportInternal(
	ExporterIFC exporterIFC
)
```

## Parameters
- **exporterIFC** (`Autodesk.Revit.DB.IFC.ExporterIFC`) - The exporter.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null